testing_cases/freelyFallingDroplets_QMOM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     monodisperseDropletFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-1;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   5e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1.0e-3;

functions
{
/*
    fieldAverage1
    {
        type            fieldAverage;
        libs            (libfieldFunctionObjects);
        writeControl    outputTime;
        timeStart       5;
        fields
        (
            U.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            d.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }
    #includeFunc writeObjects(corr)
    #includeFunc writeObjects(Kh.gas)
    #includeFunc writeObjects(Kh.liquid)
    */
    #includeFunc writeObjects(dsm)
    #includeFunc writeObjects(dvdtf)
    #includeFunc fieldMinMax
}


// ************************************************************************* //
